#+BEGIN_COMMENT
.. title: Maximum Pairwise Product
.. slug: maximum-pairwise-product
.. date: 2018-06-24 16:42:47 UTC-07:00
.. tags: algorithms problem
.. category: problem
.. link: 
.. description: Find the maximum pairwise product from a list of numbers.
.. type: text
#+END_COMMENT

#+BEGIN_SRC python :tangle maximum_pairwise_product.py :exports none
<<imports>>

<<constants>>

<<brute-force>>

<<take-three>>

<<stress-test>>

<<stress-three>>

<<sort>>

<<stress-four>>
#+END_SRC

#+RESULTS:

* Brute Force Implementation
  This is given as part of the problem. It traverses all the values and finds the largest product.

#+BEGIN_SRC python :session maxpairwise :results none
def max_pairwise_product_brute(numbers):
    """Calculates the largest pairwise-product for a list
    
    Args:
     numbers (list): integers to check

    Returns:
     int: largest product created from numbers
    """
    n = len(numbers)
    max_product = 0
    for first in range(n):
        for second in range(first + 1, n):
            max_product = max(max_product,
                              numbers[first] * numbers[second])
    return max_product
#+END_SRC

#+BEGIN_SRC python :session maxpairwise :results output
check_inputs(max_pairwise_product_brute, use_max=False)
#+END_SRC

#+RESULTS:
: Elapsed Time: 0:00:00.000009
: Elapsed Time: 0:00:00.000005
: Elapsed Time: 0:00:00.000015
: Elapsed Time: 0:00:00.000002
: Elapsed Time: 0:00:00.000003
: All passed

Because we are traversing all the numbers twice, the brute-force version has a run time of $O(n^2)$. Since the $n$ can be from $2$ to $2 \times 10^5$ that means our maximum run time will be $4 \times 10^10$, which is too large.

Running this through the grader gives this output.

#+BEGIN_EXAMPLE
Failed case #4/17: time limit exceeded (Time used: 9.98/5.00, memory used: 20905984/536870912.)
#+END_EXAMPLE

* Search
  Instead of using nested for-loops, we can search the numbers twice to find the two biggest numbers, this changes the run time to $2n$ or $O(n)$.

#+BEGIN_SRC python :session maxpairwise :results none
def max_pairwise_product_take_two(numbers):
    """Finds the maximum pairwise product in te numbers
    
    Args:
     numbers (list): non-negative integers

    Returns:
     int: largest possible product from the numbers
    """    
    first_index = 0
    first_value = 0
    n = len(numbers)
    assert n >= 2
    for index in range(1, n):
        if numbers[index] > first_value:
            first_value = numbers[index]
            first_index = index

    second_value = 0
    start = 1 if first_index == 0 else 0
    for index in range(start, n):
        if index != first_index and numbers[index] > second_value:
            second_value = numbers[index]
    return first_value * second_value
#+END_SRC

#+BEGIN_SRC python :session maxpairwise :results output
check_inputs(max_pairwise_product_take_two)
#+END_SRC

#+RESULTS:
: Elapsed Time: 0:00:00.000006
: Elapsed Time: 0:00:00.000004
: Elapsed Time: 0:00:00.000003
: Elapsed Time: 0:00:00.000003
: Elapsed Time: 0:00:00.000002
: Max Case
: Elapsed Time: 0:00:00.076238
: All passed

This one passes the grader, doing surprisingly well, even though I was thinking it would need more optimizing.

#+BEGIN_EXAMPLE
Good job! (Max time used: 0.15/5.00, max memory used: 26734592/536870912.)
#+END_EXAMPLE 

* Another Improvement
  Rather than go through the second loop, I thought that since the previous maximum value is always the next highest value so far, we can just save it directly.

#+BEGIN_SRC python :session maxpairwise :results none :noweb-ref take-three
def max_pairwise_product_take_three(numbers):
    """Finds the maximum pairwise product in te numbers
    
    Args:
     numbers (list): non-negative integers

    Returns:
     int: largest possible product from the numbers
    """    
    max_value = 0
    previous_value = 0
    n = len(numbers)
    assert n >= 2
    for number in numbers:
        if number > max_value:
            previous_value, max_value = max_value, number
        elif number > previous_value:
            previous_value = number
    return max_value * previous_value
#+END_SRC

#+BEGIN_SRC python :session maxpairwise :results output
check_inputs(max_pairwise_product_take_three)
#+END_SRC

#+RESULTS:
: Elapsed Time: 0:00:00.000003
: Elapsed Time: 0:00:00.000002
: Elapsed Time: 0:00:00.000002
: Elapsed Time: 0:00:00.000002
: Elapsed Time: 0:00:00.000002
: Max Case
: Elapsed Time: 0:00:00.013470
: All passed

* Boosted Brute Force
  To try and get this working I'm going to use numba to (hopefully) speed it enough to make the stress test runnable.


#+BEGIN_SRC python :session maxpairwise :results none :noweb-ref brute-force
@jit
def max_pairwise_product_brute_jit(numbers):
    """Calculates the largest pairwise-product for a list
    
    Args:
     numbers (list): integers to check

    Returns:
     int: largest product created from numbers
    """
    n = len(numbers)
    max_product = 0
    for first in range(n):
        for second in range(first + 1, n):
            max_product = max(max_product,
                              numbers[first] * numbers[second])
    return max_product
#+END_SRC

#+BEGIN_SRC python :session maxpairwise :results output :noweb-ref stress-three
print("One Pass Method")
stress_test(max_pairwise_product_take_three, tag="One-Pass", iterations=10)
#+END_SRC

#+RESULTS:
#+begin_example
One Pass Method
,***** (One-Pass) Trial: 1 *****
Input Size: 60233
Running Brute Force
Brute Force Time: 0:00:01.970703
Running One-Pass implementation
Implementation Time: 0:00:00.009215
Elapsed time: 0:00:01.981123
,***** (One-Pass) Trial: 2 *****
Input Size: 27417
Running Brute Force
Brute Force Time: 0:00:00.365186
Running One-Pass implementation
Implementation Time: 0:00:00.004224
Elapsed time: 0:00:00.370649
,***** (One-Pass) Trial: 3 *****
Input Size: 75453
Running Brute Force
Brute Force Time: 0:00:02.863530
Running One-Pass implementation
Implementation Time: 0:00:00.011985
Elapsed time: 0:00:02.877185
,***** (One-Pass) Trial: 4 *****
Input Size: 107744
Running Brute Force
Brute Force Time: 0:00:05.956950
Running One-Pass implementation
Implementation Time: 0:00:00.016540
Elapsed time: 0:00:05.975503
,***** (One-Pass) Trial: 5 *****
Input Size: 157904
Running Brute Force
Brute Force Time: 0:00:12.964412
Running One-Pass implementation
Implementation Time: 0:00:00.034737
Elapsed time: 0:00:13.002612
,***** (One-Pass) Trial: 6 *****
Input Size: 82668
Running Brute Force
Brute Force Time: 0:00:03.488774
Running One-Pass implementation
Implementation Time: 0:00:00.013501
Elapsed time: 0:00:03.503706
,***** (One-Pass) Trial: 7 *****
Input Size: 14755
Running Brute Force
Brute Force Time: 0:00:00.115763
Running One-Pass implementation
Implementation Time: 0:00:00.002300
Elapsed time: 0:00:00.119402
,***** (One-Pass) Trial: 8 *****
Input Size: 69076
Running Brute Force
Brute Force Time: 0:00:02.548347
Running One-Pass implementation
Implementation Time: 0:00:00.010787
Elapsed time: 0:00:02.560393
,***** (One-Pass) Trial: 9 *****
Input Size: 99186
Running Brute Force
Brute Force Time: 0:00:05.278385
Running One-Pass implementation
Implementation Time: 0:00:00.018820
Elapsed time: 0:00:05.299441
,***** (One-Pass) Trial: 10 *****
Input Size: 51535
Running Brute Force
Brute Force Time: 0:00:01.305226
Running One-Pass implementation
Implementation Time: 0:00:00.007414
Elapsed time: 0:00:01.313900
Max One-Pass time: 0:00:00.034737
#+end_example

